# IFC_DMSetFieldEnable

## Description
Sets the indicated field enabled.

```pascal
FUNCTION IFC_DMSetFieldEnable(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				inStrFieldName : STRING;
				bEnable        : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_DMSetFieldEnable(inStrObjName, inStrEntryName, inStrFieldName, bEnable):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||
|inStrFieldName|STRING||
|bEnable|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* IFC